taskleaf/app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY "tasks"."created_at" DESC  [["user_id", 3]]

  def create
    @task = current_user.tasks.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "adminのタスク"], ["description", "adminのタスクです"], ["created_at", "2022-03-16 09:13:15.919004"], ["updated_at", "2022-03-16 09:13:15.919004"], ["user_id", 3]]

  def update
    task.update!(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "adminのタスクです\r\nああああ"], ["updated_at", "2022-03-16 09:13:42.275462"], ["id", 1]]

  def destroy
    task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 3], ["id", 4], ["LIMIT", 1]]