taskleaf/app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$eBnne3B9fYcMeFM7NwDvtO6/dFfVkUPUz3xGrg88MEfge33JIn5CC"], ["updated_at", "2022-03-16 09:15:36.398254"], ["id", 5]]